# MEPCalculationServerInfo Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPCalculationServerInfo Constructor
MEPCalculationServerInfo Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MEPCalculationServerInfo()()()() | Constructs a new MEPCalculationServerInfo with default settings. |
| MEPCalculationServerInfo(IExternalServer) | Create a new MEPCalculationServerInfo by an external server. |
| MEPCalculationServerInfo(MEPCalculationServerInfo) | Constructs a new copy of the input MEPCalculationServerInfo object. |

# See Also
MEPCalculationServerInfo Class
MEPCalculationServerInfo Members
Autodesk.Revit.DB Namespace